[{}, {
	"heading": "Let's take a trip back in time... back to when there were only local TV channels 🙀, back to when TikTok was not a thing 😖, back to when bubble gum was still legal 😋...",
	"choices": [{
		"label": "Ok...",
		"screenTo": 2
	}],
	"backgroundImgPath": "images/time.jpeg"
}, {
	"heading": "The year is 1984, Singapore has been enjoying a continuous GDP growth of 8.5%  over the past few years. Lurking in the shadows, the construction market becomes increasingly saturated and few projects have been in the pipeline for completion. The construction industry is slowing down...",
	"text": "The nation is heading towards a recession, and the government does not know much about it...",
	"choices": [{
		"label": "Ok...",
		"screenTo": 3
	}],
	"backgroundImgPath": "images/time.jpeg"
}, {
	"heading": "Now in 1985, Singapore posts a growth rate of -1.4 percent, and it continues dropping as days go by...",
	"text": "Oh no... companies are going bankrupt, workers are being retrenched and the unemployment figure rises to 4.1 percent...",
	"choices": [{
		"label": "Oh...",
		"screenTo": 4
	}],
	"backgroundImgPath": "images/down.jpeg"
}, {
	"heading": "YOU, the Minister for Trade and Industry, now have to deal with this sudden crisis. How are you going to handle it?",
	"text": "First, you ask your trusted apprentice ChatGPT for advice and it lists these options for you. (Please don't do this in real life) Which one will you pick?",
	"choices": [{
		"label": "Lower interest rates, increase the money supply and reduce the exchange rate. This stimulates investments and consumption. However, it is possible that this could lead to high inflation and currency depreciation, eroding the competitiveness of the economy.",
		"screenTo": 5
	}, {
		"label": "Reduce government spending and increase taxes. This will allow the government to have more savings, but might lead to very high unemployment rates.",
		"screenTo": -1,
		"endMessage": "Oh no! With less spending and decreased spending power of citizens, economic growth is further reduced. The recession worsens."
	}, {
		"label": "Increase government spending on infrastructure projects. This can boost demand and create jobs. However, this can also lead to higher government debt and reduced fiscal flexibility in the future.",
		"screenTo": 6
	}, {
		"label": "Resort to protectionism. The government subsidises domestic industries and implements trade barriers to protect local industries from foreign competition. Local jobs are protected but consumer prices increase.",
		"screenTo": -1,
		"endMessage": "Oh no! Given Singapore’s small market, our economy is highly dependent on imports and exports. Being one of the most trade-dependent economies globally, protectionism not only cuts imports from other countries, it could also limit exports, worsening the recession and financial instability Singapore is in."
	}],
	"backgroundImgPath": "images/down.jpeg"
}, {
	"heading": "This can work! In fact, the government recommended a reduction of employers’ Central Provident Fund (CPF) contribution rates by 15% and enforced a wage restraint for the public sector.",
	"text": "Companies are incentivised to both maintain workers’ employability during a downturn, as well as reduce businesses’ labour costs. By balancing the fiscal policies and money supply in the economy, Singapore is able to expel the concern of inflation.",
	"choices": [{
		"label": "Nice!",
		"screenTo": 7
	}],
	"backgroundImgPath": "images/up.jpeg"
}, {
	"heading": "This can work! In fact, Singapore introduced a 30% across-the-board investment allowance for expenditures on capital equipment and machinery.",
	"text": "While tax reductions and investment incentives could be seen as a direct incentive to firms and businesses, the raising of public development spending represented fiscal expenditures to drive up economic activity.",
	"choices": [{
		"label": "Nice!",
		"screenTo": 7
	}],
	"backgroundImgPath": "images/up.jpeg"
}, {
	"heading": "Now that the situation's over, you need to make some changes to government policy in order to prevent such a crisis from happening again.  What improvements should be made?",
	"choices": [{
		"label": "Developing and exporting our services to other nations",
		"screenTo": 8
	}, {
		"label": "Moving beyond functioning as an offshore production base (i.e. offering companies a higher-skilled workforce)",
		"screenTo": 9
	}, {
		"label": "Continue to develop into a conducive environment for businesses to thrive, such as through having competitive taxes and a strong regulatory regime.",
		"screenTo": 10
	}, {
		"label": "Free trade: enforcing minimum tariffs and other restrictions on the import of both goods and services.",
		"screenTo": 11
	}, {
		"label": "Government forecasting and information (i.e. government pays closer intention to the financial situation in Singapore)",
		"screenTo": 12
	}],
	"backgroundImgPath": "images/up.jpeg"
}, {
	"heading": "You're right! In doing so, such overseas operations will account for an increasing share of our income.",
	"text": "The offshore activities will be extensions of our domestic economy, offsetting our small size and broadening our base, preventing future economic crises from affecting too many people.",
	"choices": [{
		"label": "Nice!",
		"screenTo": 13
	}],
	"backgroundImgPath": "images/up.jpeg"
}, {
	"heading": "Good choice! Singapore must become an international total business centre for manufacturing and services. Companies should not only set up production plants in Singapore, they should also establish operational headquarters here.",
	"text": "In this way, they will use our advantages to the full, providing skilled, challenging and rewarding employment for Singaporeans. That way, Singapore won’t face an economic crisis if businesses decide to move their production bases elsewhere.",
	"choices": [{
		"label": "Nice!",
		"screenTo": 13
	}],
	"backgroundImgPath": "images/up.jpeg"
}, {
	"heading": "This attracts foreign businesses to set up plants and bases in Singapore, granting more employment opportunities to the locals. By having a strong regulatory regime, we can develop an atmosphere of trust and confidence in the country. Businesses will be more willing to invest in our country, allowing the nation to grow and prosper.",
	"text": "When the nation prospers, there is stronger economic defence as the increased revenue will allow the government to have more savings so as to deal with a future economic crisis.",
	"choices": [{
		"label": "Nice!",
		"screenTo": 13
	}],
	"backgroundImgPath": "images/up.jpeg"
}, {
	"heading": "Indeed... As a small economy, Singapore will never be able to provide a domestic base for our companies. Our businessmen must look outwards and become internationally competitive.",
	"text": "Our free trade policy is necessary to strengthen resilience in our businesses and economy. This makes it possible for Singapore to survive and be internationally competitive in the long run. With strong economic ties with other countries, our supply chains will be more resilient when an economic crisis strikes.",
	"choices": [{
		"label": "Nice!",
		"screenTo": 13
	}],
	"backgroundImgPath": "images/up.jpeg"
}, {
	"heading": "Yes, this is important! The government should try to improve its economic forecasting and provide more timely and accurate information to the private sector. Private sector organisations should do more independent analyses of economic data and trends.",
	"text": "The dangers of basing plans and policies on imperfect forecasts will be reduced. The dangers of basing plans and policies on imperfect forecasts will be reduced. Thus, plans and policies can be made before an economic crisis strikes.",
	"choices": [{
		"label": "Nice!",
		"screenTo": 14
	}],
	"backgroundImgPath": "images/up.jpeg"
}, {
	"heading": "The other options also work, so we recommend you try them out!",
	"choices": [{
		"label": "Go back",
		"screenTo": 7
	}, {
		"label": "Continue",
		"screenTo": 15
	}],
	"backgroundImgPath": "images/up.jpeg"
}, {
	"heading": "The 1985 economic crisis was just the first that Singapore faced. In 1997, Asian Financial Crisis meant that Singapore was once again faced with the prospect of a recession. However, armed with experience and knowledge from 1985, the government was able to react swiftly and decisively. The Singapore government’s response to the 1997 crisis was remarkably similar those that were implemented in 1985.",
	"choices": [{
		"label": "Interesting...",
		"screenTo": 16
	}],
	"backgroundImgPath": "images/up.jpeg"
}, {
	"heading": "Yet, not everything went smoothly as Singapore faced one of its worst recessions in 2008 when the effects of the Global Financial Crisis hit the nation. The government had to use large amounts of savings to help the economy recover, showing how important they are in Singapore's economic defence.",
	"choices": [{
		"label": "Interesting...",
		"screenTo": 16
	}],
	"backgroundImgPath": "images/up.jpeg"
}, {
	"heading": "Understanding Singapore’s approach to economic governance is important as our economy is unique.  Leaders who understood this were able to use state-centric approaches to manage major economic crises and in doing so, they ensured the economy's continued stability. Indeed, Singapore’s economic resilience was rooted in its sound macroeconomic policies (more of which you will learn in JC) and the state’s willingness to take effective and timely policy measures to counter or manage the adverse effects of economic crises.",
	"choices": [{
		"label": "Ok!",
		"screenTo": -2,
		"endMessage": "References (we strongly recommend you check it out): https://docs.google.com/document/d/1iIMxZdsNWRBeQqPd4WllavzZVPqTWu4BpcSM4uMJ_bM/edit?usp=sharing"
	}],
	"backgroundImgPath": "images/up.jpeg"
}]
