[{}, {
	"heading": "一个风和日丽、凉风习习的早上, Da Ming is still sleeping, but then the alarm rings. Should he wake up?",
	"choices": [{
		"label": "Yes",
		"screenTo": 2
	},
	{
		"label": "No",
		"screenTo": 3
	}],
	
	"backgroundImgPath": "images/bedroom.jpeg"
	},{
	"heading": "Da Ming gets ready to go to school and leaves energetically! (100% move speed)",
	"choices": [{
		"label": "Yay!",
		"screenTo": 4
	}]
	},{
	"heading": "Da Ming gets caned 10 times and now his back is sore! (50% move speed)",
	"choices": [{
		"label": "Aww...",
		"screenTo": 4
	}]
	},{
		"heading": "A person enters the MRT station and behaves suspiciously. Da Ming, engrossed in playing Mobile Legends, doesn't notice the suspicious behavior. The suspicious person places a black backpack on a seat, catching Da Ming's attention. Da Ming tries to locate the person, eventually finding him and informing him about the forgotten bag. The person ignores Da Ming and flees, leaving him feeling dejected. Da Ming returns to the platform and hears an announcement urging passengers to report suspicious individuals or items to staff or use the emergency communication button. What should Da Ming do now?",
	"choices": [{
		"label": "Ignore it",
		"screenTo": -1,
		"endMessage": "The bomb explodes and you die."
	},{
		"label": "Report it!!! So sus!!!",
		"screenTo": 5
	}],
	"backgroundImgPath": "images/mrtstation.jpeg"
	},{
	"heading": "Station staff removes it and you successfully enter the MRT train!",
	"choices": [{
		"label": "Yay!",
		"screenTo": 6
	}],
	"backgroundImgPath": "images/mrtstation.jpeg"
	},{
	"heading": "Da Ming boards the train. As the announcer says “Next station: Tan Kah Kee 陈嘉庚”... ",
	"choices": [{
		"label": "Continue",
		"screenTo": 7
	}],
	"backgroundImgPath": "images/mrtstation.jpeg"
	},{
	"heading": "Boom!!!!!!! A bomb explodes on the train. Da Ming fell to the ground with a loud thud. There is rubble everywhere, blood sparsely spewed over the ground. He notices people rushing for the exit, but the old men sitting on the reserved seats need help. He has to help them to the exit!",
	"choices": [{
		"label": "Continue",
		"screenTo": 8
	}],
	"backgroundImgPath": "images/explosion.jpeg"
	},
	{
	"heading": "Use arrow keys to control Da Ming's character. ",
	"choices": [{
		"label": "Continue",
		"screenTo": -3
	}],
	"backgroundImgPath": "images/explosion.jpeg"
	},
	{
	"heading": "He did it! He survived the explosion and lived to tell the tale! In school, everyone is proud of him that he helped the old men and were vigilant.",
	"choices": [{
		"label": "Hooray!!",
		"screenTo": -2
	}]	
	}
]
