[{}, 
	{
		"heading": "一个风和日丽、凉风习习的早上, Da Ming is still sleeping, but then the alarm rings. Should he wake up?",
		"choices": [{
			"label": "Yes",
			"screenTo": 2
		},
		{
			"label": "No",
			"screenTo": 3
		}],
		
		"backgroundImgPath": "images/bedroom.jpeg"
	}, {
		"heading": "Da Ming gets ready to go to school and leaves energetically! (100% move speed)",
		"choices": [{
			"label": "Yay!",
			"screenTo": 4
		}]
	}, {
		"heading": "Da Ming gets caned 10 times and now his back is sore! (50% move speed)",
		"choices": [{
			"label": "Aww...",
			"screenTo": 4
		}]
	}, {
		"heading": "A person enters the MRT station and behaves suspiciously. Da Ming, engrossed in playing Mobile Legends, doesn't notice the suspicious behavior. The suspicious person places a black backpack on a seat, catching Da Ming's attention. Da Ming tries to locate the person, eventually finding him and informing him about the forgotten bag. The person ignores Da Ming and flees, leaving him feeling dejected. Da Ming returns to the platform and hears an announcement urging passengers to report suspicious individuals or items to staff or use the emergency communication button. What should Da Ming do now?",
		"choices": [{
			"label": "Ignore it",
			"screenTo": -1,
			"endMessage": "The bomb explodes and you die."
		},{
			"label": "Report it!!! So sus!!!",
			"screenTo": 5
		}],
		"backgroundImgPath": "images/mrtstation.jpeg"
	}, {
		"heading": "Station staff removes it and you successfully enter the MRT train!",
		"choices": [{
			"label": "Yay!",
			"screenTo": 6
		}],
		"backgroundImgPath": "images/mrtstation.jpeg"
	}, {
		"heading": "Da Ming boards the train. As the announcer says “Next station: Tan Kah Kee 陈嘉庚”... ",
		"choices": [{
			"label": "Continue",
			"screenTo": 7
		}],
		"backgroundImgPath": "images/mrtstation.jpeg"
	}, {
		"heading": "Boom!!!!!!! A bomb explodes on the train. Da Ming fell to the ground with a loud thud. There is rubble everywhere, blood sparsely spewed over the ground. He notices people rushing for the exit, but the old men sitting on the reserved seats need help. He has to help them to the exit!",
		"choices": [{
			"label": "Continue",
			"screenTo": 8
		}],
		"backgroundImgPath": "images/explosion.jpeg"
	}, {
		"heading": "Use arrow keys to control Da Ming's character. Bring the old men to the exit, which is the green part on the left.",
		"choices": [{
			"label": "Continue",
			"screenTo": -3
		}],
		"backgroundImgPath": "images/explosion.jpeg"
	}, {
		"heading": "He did it! He survived the explosion and lived to tell the tale! Da Ming, being the gigachad he is, used his jawline to carve his way out of the rubble and exited the train tunnel. He calmly makes his way to school.",
		"choices": [{
			"label": "Hooray!!",
			"screenTo": 10
		}]	
	}, {
		"heading": "Things go on as usual, lessons go by, and during Math class, the announcement “dry ground, dry ground” plays over the PA. But, there was no drill planned that week?",
		"choices": [{
			"label": "It must be a terrorist attack! Quick, Da Ming should run for his life!!!!",
			"screenTo": -1,
			"endMessage": "Da Ming run out of the classroom and bump headfirst into the terrorist. After an awkward exchange and some small talk, Da Ming is shot."
		}, {
			"label": "Wait for further instruction",
			"screenTo": 11
		}]
	}, {
		"heading": "Da Ming and his class continues waiting for further announcement. They are now ordered to evacuate. But his math teacher shouts: EVERYONE STAY HERE! ALL OF YOU MUST FINISH YOUR COMPLETING THE SQUARE WORKSHEET BEFORE YOU CAN GO!!!!!!!!!!!!!!!!!!",
		"choices": [{
			"label": "Continue grinding math problems as a diligent student",
			"screenTo": -1,
			"endMessage": "Five minutes later, the terrorist enters the room. Reading the tense situation and Da Ming's scary math teacher, he sits down and starts doing math problem sums. However, he quickly remembers his goal and Da Ming misteriously passes away while doing algebraic manipulation."
		}, {
			"label": "Plan a rebellion against his math teacher's instructions and begin lockdown measures",
			"screenTo": 12
		}]
	}, {
		"heading": "Da Ming's math teacher will scold him next lesson but he will have a much higher chance of living. What does Da Ming do now?",
		"choices": [{
			"label": "Arrange the tables into the shape of an amogus to confuse and hypnotize the terrorist",
			"screenTo": 13
		},{
			"label": "Close the windows, blinds, and lights, and exert Da Ming's power as math rep to force everyone under the tables",
			"screenTo": 14
		}, {
			"label": "Do Rock you in class repeatedly as a form of intimidation against terrorists",
			"screenTo": -1,
			"endMessage": "The terrorist is impressed with their school spirit! Unfortunately everyone was so enthusiastic everyone got a fatal ankle sprain while stomping."
		}]
	}, {
		"heading": "What does Da Ming do now?",
		"choices": [{
			"label": "Arm his classmates with table legs, chairs, scissors, glue, hole punchers - heavy duty stationary",
			"screenTo": -1,
			"endMessage": "A few minutes later, the terrorist opened the door of the classroom, only to be ambushed by a class of rabid schoolchildren. The terrorist is quickly and violently annoyed. One can imagine what happened next... This is the Bad ending :((("
		}, {
			"label": "Sing Cruel Summer in class repeatedly as a form of protest against Singapore's weather.",
			"screenTo": -1,
			"endMessage": "The terrorist is not intimidated and Daming's class dies swiftly"
		}]
	}, {
		"heading": "What does Da Ming do next?",
		"choices": [{
			"label": "Wedge chairs in front of the door to block intruders",
			"screenTo": 15
		}, {
			"label": "Sing Cruel Summer in class repeatedly as a form of protest against Singapore's weather.",
			"screenTo": -1,
			"endMessage": "The terrorist is not intimidated and Daming's class dies swiftly"
		}, {
			"label": "Arrange the tables into the shape of an amogus to confuse and hypnotize the terrorist",
			"screenTo": -1,
			"endMessage": "The terrorist walks by, using his gun barrel to knock on doors. As he gets closer, Da Ming realises he forgot to barricade their door. The door is busted open and the terrorist enters...The amogus did not help"
		}]
	}, {
		"heading": "Suddenly, Da Ming sees his friend pulling out his phone. This gave him an idea. What does he do?",
		"choices": [{
			"label": "Get his friend to notify the authorities of the terrorist attack via SGSecure",
			"screenTo": -2,
			"endMessage": "Good job! The police are notified and they quickly subdue the terrorist. Everyone is saved! This is the good ending."
		}, {
			"label": "Turn his phone to silent mode",
			"screenTo": 16
		}, {
			"label": "Scold his friend for taking out his phone in such an intense situation",
			"screenTo": -1,
			"endMessage": "In tense situations, conflicts are bound to arise. Unfortunately, the terrorist hears the commotion and forces his way into the classroom..."
		}]
	}, {
		"heading": "Good job! The terrorist walks past their class without a second thought. Daming's class is told to evacuate, but they hear gunshots in the distance...",
		"choices":[{
			"label": "Continue",
			"screenTo": 17
		}]
	}, {
		"heading": "As Daming is walking through school to the external evacuation are, a woman lies on the floor next to Daming seemingly unconscious. What should he do?",
		"choices": [{
			"label": "Perform CPR",
			"screenTo": -1,
			"endMessage": "As he leans in, the woman wakes up and slaps him. He is arrested for harrassment"
		}, {
			"label": "Perform mouth-to-mouth resuscitation",
			"screenTo": -1,
			"endMessage": "As he leans in, the woman wakes up and slaps him. He is arrested for harrassment"
		}, {
			"label": "check for a response",
			"screenTo": 18
		}]
	}, {
		"heading": "The woman appears to be breathing and has a pulse. However, she is not responsive. What should Daming do now?",
		"choices": [{
			"label": "Eh, she's probably dead. Rob her",
			"screenTo": -1,
			"endMessage": "Daming sucks as a human being and may his shoelaces be untied every five minutes"
		}, {
			"label": "Put her into a recovery position.",
			"screenTo": 19
		}, {
			"label": "Daming should post his BeReal with her unconscious body",
			"screenTo": -1,
			"endMessage": "Great job connecting with unconscious strangers! This is what the Internet was made for. Anyway, Da Ming's camera flash attracts light-seeking goblins that kidnap all the students before they evacuate. Game over"
		}]
	}, {
		"heading": "Daming rolls her onto her side and adjusts her legs so their hips and knees form right angles.",
		"choices": [{
			"label": "Da Ming tilt her head back gently to keep her airway open (without performing the chiropractic moves that he saw online)",
			"screenTo": -1,
			"endMessage": "Congrats! You made it to the end and survived, saving a fellow victim in the process. You are celebrated as a hero in your community and the woman gives you a million dollars for saving her life."
		}, {
			"lable": "Her neck looks slightly slanted. She must need a good crack in her spine. Da Ming should help her with that",
			"screenTo": -1,
			"endMessage": "Her spine now looks like a bent plastic straw. Congratulations on homicide! Da Ming is taken away by the police."
		}]	
	}
]

